results/wrk2/jsonget.txt
10:04:13 {play-2.6-with-netty} ~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t2 -R42100 -L -v http://localhost:9000/json
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/json
  2 threads and 50 connections
  Thread calibration: mean lat.: 1.435ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.415ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.29ms    2.19ms  19.31ms   88.90%
    Req/Sec    22.15k     1.69k   31.10k    73.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.60ms
 75.000%    2.47ms
 90.000%    4.84ms
 99.000%   11.85ms
 99.900%   15.59ms
 99.990%   17.39ms
 99.999%   18.38ms
100.000%   19.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.065     0.000000            1         1.00
       0.746     0.100000       210116         1.11
       0.980     0.200000       420401         1.25
       1.184     0.300000       630717         1.43
       1.384     0.400000       840537         1.67
       1.596     0.500000      1050218         2.00
       1.713     0.550000      1155319         2.22
       1.844     0.600000      1260208         2.50
       2.002     0.650000      1364927         2.86
       2.203     0.700000      1470321         3.33
       2.469     0.750000      1574907         4.00
       2.637     0.775000      1627424         4.44
       2.849     0.800000      1679904         5.00
       3.145     0.825000      1732291         5.71
       3.551     0.850000      1784797         6.67
       4.099     0.875000      1837137         8.00
       4.447     0.887500      1863558         8.89
       4.835     0.900000      1889676        10.00
       5.251     0.912500      1916035        11.43
       5.751     0.925000      1942087        13.33
       6.355     0.937500      1968446        16.00
       6.695     0.943750      1981473        17.78
       7.079     0.950000      1994643        20.00
       7.503     0.956250      2007795        22.86
       7.923     0.962500      2020830        26.67
       8.399     0.968750      2034062        32.00
       8.671     0.971875      2040557        35.56
       9.007     0.975000      2047150        40.00
       9.423     0.978125      2053643        45.71
       9.983     0.981250      2060221        53.33
      10.647     0.984375      2066789        64.00
      10.983     0.985938      2070102        71.11
      11.295     0.987500      2073359        80.00
      11.631     0.989062      2076617        91.43
      12.015     0.990625      2079870       106.67
      12.423     0.992188      2083161       128.00
      12.655     0.992969      2084856       142.22
      12.855     0.993750      2086430       160.00
      13.111     0.994531      2088090       182.86
      13.407     0.995313      2089745       213.33
      13.727     0.996094      2091370       256.00
      13.911     0.996484      2092193       284.44
      14.079     0.996875      2092996       320.00
      14.271     0.997266      2093812       365.71
      14.511     0.997656      2094653       426.67
      14.759     0.998047      2095455       512.00
      14.911     0.998242      2095870       568.89
      15.047     0.998437      2096275       640.00
      15.223     0.998633      2096688       731.43
      15.407     0.998828      2097100       853.33
      15.623     0.999023      2097502      1024.00
      15.767     0.999121      2097709      1137.78
      15.887     0.999219      2097919      1280.00
      16.015     0.999316      2098126      1462.86
      16.151     0.999414      2098320      1706.67
      16.327     0.999512      2098530      2048.00
      16.415     0.999561      2098638      2275.56
      16.511     0.999609      2098739      2560.00
      16.623     0.999658      2098837      2925.71
      16.751     0.999707      2098943      3413.33
      16.863     0.999756      2099038      4096.00
      16.959     0.999780      2099096      4551.11
      17.039     0.999805      2099149      5120.00
      17.119     0.999829      2099194      5851.43
      17.215     0.999854      2099249      6826.67
      17.311     0.999878      2099301      8192.00
      17.359     0.999890      2099323      9102.22
      17.407     0.999902      2099352     10240.00
      17.455     0.999915      2099372     11702.86
      17.551     0.999927      2099403     13653.33
      17.615     0.999939      2099424     16384.00
      17.679     0.999945      2099436     18204.44
      17.743     0.999951      2099449     20480.00
      17.839     0.999957      2099463     23405.71
      17.903     0.999963      2099474     27306.67
      17.999     0.999969      2099489     32768.00
      18.047     0.999973      2099497     36408.89
      18.063     0.999976      2099499     40960.00
      18.127     0.999979      2099507     46811.43
      18.175     0.999982      2099513     54613.33
      18.223     0.999985      2099518     65536.00
      18.287     0.999986      2099523     72817.78
      18.319     0.999988      2099525     81920.00
      18.367     0.999989      2099528     93622.86
      18.399     0.999991      2099531    109226.67
      18.479     0.999992      2099534    131072.00
      18.495     0.999993      2099537    145635.56
      18.543     0.999994      2099538    163840.00
      18.559     0.999995      2099539    187245.71
      18.639     0.999995      2099541    218453.33
      18.671     0.999996      2099542    262144.00
      18.719     0.999997      2099543    291271.11
      18.767     0.999997      2099544    327680.00
      18.879     0.999997      2099545    374491.43
      18.975     0.999998      2099546    436906.67
      18.975     0.999998      2099546    524288.00
      19.055     0.999998      2099547    582542.22
      19.055     0.999998      2099547    655360.00
      19.103     0.999999      2099548    748982.86
      19.103     0.999999      2099548    873813.33
      19.103     0.999999      2099548   1048576.00
      19.183     0.999999      2099549   1165084.44
      19.183     0.999999      2099549   1310720.00
      19.183     0.999999      2099549   1497965.71
      19.183     0.999999      2099549   1747626.67
      19.183     1.000000      2099549   2097152.00
      19.327     1.000000      2099550   2330168.89
      19.327     1.000000      2099550          inf
#[Mean    =        2.294, StdDeviation   =        2.192]
#[Max     =       19.312, Total count    =      2099550]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2523245 requests in 1.00m, 324.86MB read
Requests/sec:  42054.12
Transfer/sec:      5.41MB