results/wrk2/jsonget.txt
11:29:49 {play-2.6-with-akka-http} ~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t2 -R17000 -L -v http://localhost:9000/json
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/json
  2 threads and 50 connections
  Thread calibration: mean lat.: 3.303ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.320ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.12ms    1.50ms  28.26ms   94.03%
    Req/Sec     8.97k     1.07k   14.56k    77.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.85ms
 75.000%    2.46ms
 90.000%    3.13ms
 99.000%   10.02ms
 99.900%   16.04ms
 99.990%   20.62ms
 99.999%   26.80ms
100.000%   28.27ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.157     0.000000            1         1.00
       1.035     0.100000        85095         1.11
       1.272     0.200000       169929         1.25
       1.467     0.300000       254378         1.43
       1.653     0.400000       339336         1.67
       1.846     0.500000       424253         2.00
       1.950     0.550000       466335         2.22
       2.063     0.600000       509146         2.50
       2.185     0.650000       551790         2.86
       2.315     0.700000       593656         3.33
       2.463     0.750000       636192         4.00
       2.545     0.775000       657472         4.44
       2.635     0.800000       678638         5.00
       2.733     0.825000       699878         5.71
       2.843     0.850000       720959         6.67
       2.973     0.875000       741941         8.00
       3.047     0.887500       752720         8.89
       3.127     0.900000       763111        10.00
       3.219     0.912500       773871        11.43
       3.325     0.925000       784422        13.33
       3.455     0.937500       794962        16.00
       3.537     0.943750       800295        17.78
       3.637     0.950000       805542        20.00
       3.779     0.956250       810799        22.86
       4.005     0.962500       816098        26.67
       4.375     0.968750       821385        32.00
       4.627     0.971875       824045        35.56
       4.935     0.975000       826689        40.00
       5.327     0.978125       829326        45.71
       5.843     0.981250       831999        53.33
       6.651     0.984375       834635        64.00
       7.343     0.985938       835950        71.11
       8.311     0.987500       837285        80.00
       9.391     0.989062       838605        91.43
      10.415     0.990625       839930       106.67
      11.431     0.992188       841250       128.00
      11.935     0.992969       841917       142.22
      12.423     0.993750       842574       160.00
      12.919     0.994531       843241       182.86
      13.383     0.995313       843909       213.33
      13.863     0.996094       844570       256.00
      14.095     0.996484       844894       284.44
      14.343     0.996875       845231       320.00
      14.583     0.997266       845559       365.71
      14.847     0.997656       845892       426.67
      15.127     0.998047       846218       512.00
      15.295     0.998242       846385       568.89
      15.471     0.998437       846550       640.00
      15.655     0.998633       846716       731.43
      15.855     0.998828       846887       853.33
      16.055     0.999023       847045      1024.00
      16.183     0.999121       847129      1137.78
      16.319     0.999219       847211      1280.00
      16.479     0.999316       847299      1462.86
      16.639     0.999414       847379      1706.67
      16.847     0.999512       847464      2048.00
      16.959     0.999561       847505      2275.56
      17.103     0.999609       847543      2560.00
      17.247     0.999658       847584      2925.71
      17.455     0.999707       847629      3413.33
      17.679     0.999756       847666      4096.00
      17.903     0.999780       847688      4551.11
      18.207     0.999805       847710      5120.00
      18.671     0.999829       847729      5851.43
      19.247     0.999854       847749      6826.67
      19.855     0.999878       847770      8192.00
      20.287     0.999890       847780      9102.22
      20.655     0.999902       847791     10240.00
      21.119     0.999915       847801     11702.86
      21.615     0.999927       847811     13653.33
      22.191     0.999939       847823     16384.00
      22.303     0.999945       847827     18204.44
      22.575     0.999951       847832     20480.00
      22.975     0.999957       847837     23405.71
      23.551     0.999963       847842     27306.67
      23.935     0.999969       847848     32768.00
      24.079     0.999973       847850     36408.89
      24.271     0.999976       847853     40960.00
      24.543     0.999979       847855     46811.43
      25.023     0.999982       847858     54613.33
      25.663     0.999985       847861     65536.00
      26.063     0.999986       847862     72817.78
      26.287     0.999988       847863     81920.00
      26.319     0.999989       847864     93622.86
      26.895     0.999991       847866    109226.67
      26.927     0.999992       847867    131072.00
      27.103     0.999993       847868    145635.56
      27.103     0.999994       847868    163840.00
      27.455     0.999995       847869    187245.71
      27.663     0.999995       847870    218453.33
      27.663     0.999996       847870    262144.00
      27.775     0.999997       847871    291271.11
      27.775     0.999997       847871    327680.00
      27.775     0.999997       847871    374491.43
      28.031     0.999998       847872    436906.67
      28.031     0.999998       847872    524288.00
      28.031     0.999998       847872    582542.22
      28.031     0.999998       847872    655360.00
      28.031     0.999999       847872    748982.86
      28.271     0.999999       847873    873813.33
      28.271     1.000000       847873          inf
#[Mean    =        2.116, StdDeviation   =        1.502]
#[Max     =       28.256, Total count    =       847873]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1018983 requests in 1.00m, 131.19MB read
Requests/sec:  16982.62
Transfer/sec:      2.19MB